In [1]:
library(reshape2)

In [7]:
df = data.frame(
    name = letters[1:10],
    maths = sample(50:100,10),
    english = sample(50:100,10),
    physics = sample(50:100,10),
    chemistry = sample(50:100,10),
    hindi = sample(50:100,10)
    )
str(df)

'data.frame':	10 obs. of  6 variables:
 $ name     : Factor w/ 10 levels "a","b","c","d",..: 1 2 3 4 5 6 7 8 9 10
 $ maths    : int  98 80 90 97 77 72 85 71 84 96
 $ english  : int  59 54 88 51 75 79 89 70 84 76
 $ physics  : int  64 79 51 61 90 86 99 72 84 87
 $ chemistry: int  91 88 76 83 93 77 61 98 92 59
 $ hindi    : int  57 91 84 75 94 55 60 96 72 68

In [3]:
df

   name maths english physics chemistry hindi
1  a    57    85      65      79         61
2  b    89    64      74      61         53
3  c    88    57      53      92         70
4  d    91    58      97      68         68
5  e    78    87      67      81        100
6  f    56    68      50      74         74
7  g    63    72      75      85         80
8  h    86    83      51      75         78
9  i    76    81      55      70         58
10 j    72    69      68      98         55

In [4]:
df1 = melt(df,id.vars = c("name","hindi","english"),
           variable.name ="subject",value.name='marks')

In [8]:
str(df1)

'data.frame':	30 obs. of  5 variables:
 $ name   : Factor w/ 10 levels "a","b","c","d",..: 1 2 3 4 5 6 7 8 9 10 ...
 $ hindi  : int  61 53 70 68 100 74 80 78 58 55 ...
 $ english: int  85 64 57 58 87 68 72 83 81 69 ...
 $ subject: Factor w/ 3 levels "maths","physics",..: 1 1 1 1 1 1 1 1 1 1 ...
 $ marks  : int  57 89 88 91 78 56 63 86 76 72 ...

In [9]:
head(df1)

  name hindi english subject marks
1 a     61   85      maths   57
2 b     53   64      maths   89
3 c     70   57      maths   88
4 d     68   58      maths   91
5 e    100   87      maths   78
6 f     74   68      maths   56

In [10]:
tail(df1)

   name hindi english subject   marks
25 e    100   87      chemistry 81
26 f     74   68      chemistry 74
27 g     80   72      chemistry 85
28 h     78   83      chemistry 75
29 i     58   81      chemistry 70
30 j     55   69      chemistry 98

In [12]:
df2 = dcast(df1,name+hindi+english~subject,value.var = "marks")

In [13]:
head(df2)

  name hindi english maths physics chemistry
1 a     61   85      57    65      79
2 b     53   64      89    74      61
3 c     70   57      88    53      92
4 d     68   58      91    97      68
5 e    100   87      78    67      81
6 f     74   68      56    50      74

In [14]:
library(tidyr)

Attaching package: 'tidyr'

The following object is masked from 'package:reshape2':

    smiths

In [15]:
# gather, spread, seprate, unite,

In [16]:
# gather melt

In [18]:
head(df)

  name maths english physics chemistry hindi
1 a    98    59      64      91        57
2 b    80    54      79      88        91
3 c    90    88      51      76        84
4 d    97    51      61      83        75
5 e    77    75      90      93        94
6 f    72    79      86      77        55

In [19]:
df1 = gather(df,"Subject","Marks",c(2,4,5))
head(df1)

  name english hindi Subject Marks
1 a    59      57    maths   98
2 b    54      91    maths   80
3 c    88      84    maths   90
4 d    51      75    maths   97
5 e    75      94    maths   77
6 f    79      55    maths   72

In [22]:
df2 = spread(df1,Subject,Marks)
head(df2)

  name english hindi chemistry maths physics
1 a    59      57    91        98    64
2 b    54      91    88        80    79
3 c    88      84    76        90    51
4 d    51      75    83        97    61
5 e    75      94    93        77    90
6 f    79      55    77        72    86

In [24]:
df = data.frame(
    id = 1:10, 
    name = sample(c('mobile','laptop','tv','xbox'),10,replace=T),
    quantity = sample(10:50,10),
    price = sample(5000:50000,10),
    day = sample(1:31,10),
    month = rep(3:6,c(1,2,3,4)),
    year = rep(2018:2019,c(6,4))
    )

In [26]:
head(df)

  id name   quantity price day month year
1 1  laptop 21       13350 13  3     2018
2 2  mobile 11       27096 29  4     2018
3 3  tv     35       23418 31  4     2018
4 4  laptop 47       27682 24  5     2018
5 5  xbox   34        7913 25  5     2018
6 6  tv     28       32623 23  5     2018

In [31]:
df1 = unite(data=df,col="date",c("day","month","year"),sep="-")
head(df1)

  id name   quantity price date
1 1  laptop 21       13350 13-3-2018
2 2  mobile 11       27096 29-4-2018
3 3  tv     35       23418 31-4-2018
4 4  laptop 47       27682 24-5-2018
5 5  xbox   34        7913 25-5-2018
6 6  tv     28       32623 23-5-2018

In [32]:
df2 = separate(data=df1,col="date",into=c("Day","Month","Year")
              ,sep='-')
head(df2)

  id name   quantity price Day Month Year
1 1  laptop 21       13350 13  3     2018
2 2  mobile 11       27096 29  4     2018
3 3  tv     35       23418 31  4     2018
4 4  laptop 47       27682 24  5     2018
5 5  xbox   34        7913 25  5     2018
6 6  tv     28       32623 23  5     2018

In [33]:
library(sqldf)

Loading required package: gsubfn
Loading required package: proto
Loading required package: RSQLite

In [35]:
student = data.frame(
    sid = 1:10, 
    name = letters[1:10],
    age = sample(16:20,10,replace=T),
    height = sample(c(5.5,5.6,5.7,5.8,5.9,5.10,5.11,6),10,replace=T),
    weight = sample(c(50:80),10)
    )

game = data.frame(
    sid = sample(1:20,10),
    play = sample(c("cricket","football","kabadi"),10,replace=T),
    class = sample(c("good","average","excellient"),10,replace=T)
    )

In [37]:
head(student,3)

  sid name age height weight
1 1   a    18  6.00   75
2 2   b    16  5.60   79
3 3   c    20  5.11   68

In [38]:
head(game,3)

  sid play     class
1 13  cricket  average
2 12  football excellient
3  4  cricket  excellient

In [40]:
sqldf("select sid,name,height from student where weight >=70")

  sid name height
1 1   a    6.0
2 2   b    5.6
3 7   g    5.8
4 8   h    6.0
5 9   i    5.5

In [41]:
head(student,3)

  sid name age height weight
1 1   a    18  6.00   75
2 2   b    16  5.60   79
3 3   c    20  5.11   68

In [42]:
head(game,3)

  sid play     class
1 13  cricket  average
2 12  football excellient
3  4  cricket  excellient

In [45]:
sqldf("select name,play from student inner join game on 
student.sid=game.sid where play=='cricket'")

  name play
1 d    cricket
2 j    cricket

In [46]:
sqldf("select name,play from student left join game on 
student.sid=game.sid")

   name play
1  a    football
2  b    NA
3  c    NA
4  d    cricket
5  e    NA
6  f    NA
7  g    NA
8  h    NA
9  i    kabadi
10 j    cricket

In [48]:
sqldf("select name,play from game left join student on 
student.sid=game.sid")

   name play
1  NA   cricket
2  NA   football
3  d    cricket
4  NA   cricket
5  i    kabadi
6  NA   football
7  NA   cricket
8  a    football
9  j    cricket
10 NA   cricket

In [49]:
library(dplyr)

Attaching package: 'dplyr'

The following objects are masked from 'package:stats':

    filter, lag

The following objects are masked from 'package:base':

    intersect, setdiff, setequal, union

In [58]:
student

   sid name age height weight
1   1  a    18  6.00   75
2   2  b    16  5.60   79
3   3  c    20  5.11   68
4   4  d    20  5.50   50
5   5  e    18  5.11   66
6   6  f    17  5.10   60
7   7  g    18  5.80   71
8   8  h    19  6.00   74
9   9  i    20  5.50   80
10 10  j    19  5.70   52

In [63]:
select(student,-height,-weight)

   sid name age
1   1  a    18
2   2  b    16
3   3  c    20
4   4  d    20
5   5  e    18
6   6  f    17
7   7  g    18
8   8  h    19
9   9  i    20
10 10  j    19

In [65]:
filter(student,age>18,weight %in% 50:60)

  sid name age height weight
1  4  d    20  5.5    50
2 10  j    19  5.7    52

In [66]:
head(student)

  sid name age height weight
1 1   a    18  6.00   75
2 2   b    16  5.60   79
3 3   c    20  5.11   68
4 4   d    20  5.50   50
5 5   e    18  5.11   66
6 6   f    17  5.10   60

In [71]:
st1 = mutate(student,ratio=weight/height,wsq=sqrt(weight))

In [72]:
head(st1)

  sid name age height weight ratio     wsq
1 1   a    18  6.00   75     12.500000 8.660254
2 2   b    16  5.60   79     14.107143 8.888194
3 3   c    20  5.11   68     13.307241 8.246211
4 4   d    20  5.50   50      9.090909 7.071068
5 5   e    18  5.11   66     12.915851 8.124038
6 6   f    17  5.10   60     11.764706 7.745967

In [79]:
arrange(student,desc(height),desc(weight))[1:5,]

  sid name age height weight
1  1  a    18  6.0    75
2  8  h    19  6.0    74
3  7  g    18  5.8    71
4 10  j    19  5.7    52
5  2  b    16  5.6    79

In [81]:
data  = data.frame(
    sex = sample(c("male","female"),25,replace=T),
    height = sample(c(5.4,5.5,5.6,5.7,5.8,5.9,5.10,5.11,6),25,
                   replace=T),
    weight = sample(40:80,25,replace=T),
    salary = sample(20000:50000,25)
    )

In [82]:
head(data)

  sex    height weight salary
1 female 5.8    63     29866
2 female 5.7    52     35755
3 male   5.1    57     45592
4 female 5.7    69     31788
5 male   5.6    70     31483
6 male   5.6    70     42335

In [86]:
group_by(data,sex) %>% summarise(Height=mean(height),
                                 Weight=mean(weight))

  sex    Height   Weight
1 female 5.622222 57.88889
2 male   5.581250 62.93750

In [88]:
student

   sid name age height weight
1   1  a    18  6.00   75
2   2  b    16  5.60   79
3   3  c    20  5.11   68
4   4  d    20  5.50   50
5   5  e    18  5.11   66
6   6  f    17  5.10   60
7   7  g    18  5.80   71
8   8  h    19  6.00   74
9   9  i    20  5.50   80
10 10  j    19  5.70   52

In [89]:
game

   sid play     class
1  13  cricket  average
2  12  football excellient
3   4  cricket  excellient
4  15  cricket  average
5   9  kabadi   average
6  17  football average
7  18  cricket  good
8   1  football average
9  10  cricket  average
10 11  cricket  good

In [97]:
s1 = student[1:6,]
s2 = student[4:9,]

In [99]:
s1

  sid name age height weight
1 1   a    18  6.00   75
2 2   b    16  5.60   79
3 3   c    20  5.11   68
4 4   d    20  5.50   50
5 5   e    18  5.11   66
6 6   f    17  5.10   60

In [100]:
s1

  sid name age height weight
1 1   a    18  6.00   75
2 2   b    16  5.60   79
3 3   c    20  5.11   68
4 4   d    20  5.50   50
5 5   e    18  5.11   66
6 6   f    17  5.10   60

In [101]:
s2

  sid name age height weight
4 4   d    20  5.50   50
5 5   e    18  5.11   66
6 6   f    17  5.10   60
7 7   g    18  5.80   71
8 8   h    19  6.00   74
9 9   i    20  5.50   80

In [102]:
intersect(s1,s2)

  sid name age height weight
1 4   d    20  5.50   50
2 5   e    18  5.11   66
3 6   f    17  5.10   60

In [103]:
union(s1,s2)

  sid name age height weight
1 1   a    18  6.00   75
2 2   b    16  5.60   79
3 3   c    20  5.11   68
4 4   d    20  5.50   50
5 5   e    18  5.11   66
6 6   f    17  5.10   60
7 7   g    18  5.80   71
8 8   h    19  6.00   74
9 9   i    20  5.50   80

In [104]:
setdiff(s1,s2)

  sid name age height weight
1 1   a    18  6.00   75
2 2   b    16  5.60   79
3 3   c    20  5.11   68

In [105]:
setequal(s1,s2)

[1] FALSE

In [106]:
inner_join(student,game,by='sid')

  sid name age height weight play     class
1  1  a    18  6.0    75     football average
2  4  d    20  5.5    50     cricket  excellient
3  9  i    20  5.5    80     kabadi   average
4 10  j    19  5.7    52     cricket  average

In [107]:
left_join(student,game,by='sid')

   sid name age height weight play     class
1   1  a    18  6.00   75     football average
2   2  b    16  5.60   79     NA       NA
3   3  c    20  5.11   68     NA       NA
4   4  d    20  5.50   50     cricket  excellient
5   5  e    18  5.11   66     NA       NA
6   6  f    17  5.10   60     NA       NA
7   7  g    18  5.80   71     NA       NA
8   8  h    19  6.00   74     NA       NA
9   9  i    20  5.50   80     kabadi   average
10 10  j    19  5.70   52     cricket  average

In [109]:
right_join(student,game,by='sid')

   sid name age height weight play     class
1  13  NA   NA   NA    NA     cricket  average
2  12  NA   NA   NA    NA     football excellient
3   4  d    20  5.5    50     cricket  excellient
4  15  NA   NA   NA    NA     cricket  average
5   9  i    20  5.5    80     kabadi   average
6  17  NA   NA   NA    NA     football average
7  18  NA   NA   NA    NA     cricket  good
8   1  a    18  6.0    75     football average
9  10  j    19  5.7    52     cricket  average
10 11  NA   NA   NA    NA     cricket  good

In [110]:
full_join(student,game)

Joining, by = "sid"

   sid name age height weight play     class
1   1  a    18  6.00   75     football average
2   2  b    16  5.60   79     NA       NA
3   3  c    20  5.11   68     NA       NA
4   4  d    20  5.50   50     cricket  excellient
5   5  e    18  5.11   66     NA       NA
6   6  f    17  5.10   60     NA       NA
7   7  g    18  5.80   71     NA       NA
8   8  h    19  6.00   74     NA       NA
9   9  i    20  5.50   80     kabadi   average
10 10  j    19  5.70   52     cricket  average
11 13  NA   NA    NA   NA     cricket  average
12 12  NA   NA    NA   NA     football excellient
13 15  NA   NA    NA   NA     cricket  average
14 17  NA   NA    NA   NA     football average
15 18  NA   NA    NA   NA     cricket  good
16 11  NA   NA    NA   NA     cricket  good